package ch02.ex1_1_HelloWorld

/**
 * 2.1 基本要素：関数と変数
 * 2.1.1 Hello World!
 * 2.1.2 関数
 * 2.1.3 変数
 * 2.1.4 より簡潔な文字列のフォーマット：文字列テンプレート
 * 2.2 クラスとプロパティ
 * 2.2.1 プロパティ
 * 2.2.2 カスタムアクセサ
 * 2.2.3 Kotlinのソースコードレイアウト：ディレクトリとパッケージ
 * 2.3 選択肢を表現し、処理する：enumとwhen
 * 2.3.1 enumクラスを宣言する
 * 2.3.2 whenを使ってenumクラスを処理する
 * 2.3.3 任意のオブジェクトに対してwhenを使う
 * 2.3.4 引数なしでwhenを使う
 * 2.3.5 型のチェックとキャストが一体化がしたスマートキャスト
 * 2.3.6 リファクタリング：ifをwhenに置き換える
 * 2.3.7 ifをwhenの分岐先でのブロック
 * 2.4 繰り返し処理：whileとforのループ
 * 2.4.1 whileループ
 * 2.4.2 数字を使った繰り返し処理：レンジとプログレッション
 * 2.4.3 マップの繰り返し処理
 * 2.4.4 コレクションやレンジの一員であることを調べるためにinを使用する
 * 2.5 Kotlinにおける例外処理
 * 2.5.1 try,catch,finally
 * 2.5.2 式としてのtry
 * 2.6 まとめ
 */


fun main(args: Array<String>) = println("Hello, world!")
